//常用正则表达式
let regGather = {
    //移动手机号码
    regChinaMobile: /^(134|135|136|137|138|139|147|150|151|152|157|158|159|182|187|188)\d{8}$/,
    //手机号码
    regMobile: /^1[3|4|5|7|8]\d{9}$/,
    //验证座机是否符合要求,包含区号,正确的格式为:"0835-2345670" 
    regPhone: /^((0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/,
    //由汉字、字母、数字组成的字符串
    regStr1: "^[0-9a-zA-Z\u4e00-\u9fa5]+$",
    //由英文字母、数字、下划线组成的字符串
    regStr2: /^[0-9a-zA-Z\_]+$/,
    //身份证正则表达式(15位) 
    regIDCard1: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/,
    //身份证正则表达式(18位)
    regIDCard2: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/,
    // 邮箱地址
    regEmail: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
    //qq
    regQQ: /^[1-9]\d{4,8}$/,
    //ip
    regIp: /^(\d+)\.(\d+)\.(\d+)\.(\d+)$/,
    //url
    regUrl: /^http:\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\:+!]*([^<>])*$/,
    //smtp
    regSmtp: /^smtp+\.[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\:+!]*([^<>])*$/,
    //日期格式,形如yyyy-mm-dd
    date: /^(\d{4})-(\d{2})-(\d{2})$/,
    //时间格式,形如hh:mm:ss
    time: /^([0-2][0-9]):([0-5][0-9]):([0-5][0-9])$/,
    //日期时间格式,形如yyyy-mm-dd hh:mm:ss
    dateTime: /^(\d{4})-(\d{2})-(\d{2}) (\d{2}):(\d{2}):(\d{2})$/
};
export default regGather;